Дошкольное_учреждение83/src/Catalogs/удуУчетныеЕдиницы/удуУчетныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуУчетныеЕдиницы</name>
  <basedOn>Catalog.удуМноготомники</basedOn>
  <basedOn>Catalog.удуСерии</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.удуВидыМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многотомник</name>
    <type>
      <types>CatalogRef.удуМноготомники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиДОУ</name>
    <type>
      <types>CatalogRef.удуНаправленияДеятельностиДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НедоступенКВыдаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПерИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОтносящиесяКЗаглавию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.удуСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>Учредитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.удуРолиАвтора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образы</name>
    <attributes>
      <name>Образ</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Издательства</name>
    <attributes>
      <name>Издательство</name>
      <type>
        <types>CatalogRef.удуИздательства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоИздания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтандартногоНомера</name>
      <type>
        <types>EnumRef.удуВидыСтандартныхНомеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/AccumulationRegisters/удуМетодическиеМатериалыНаРуках/удуМетодическиеМатериалыНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуМетодическиеМатериалыНаРуках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыдачи</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/AccumulationRegisters/удуТМЦ_НаСкладах/удуТМЦ_НаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуТМЦ_НаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.удуНоменклатура</types>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуНедоступныеМетодическиеМатериалы/удуНедоступныеМетодическиеМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуНедоступныеМетодическиеМатериалы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуОбозначенияМетодическихМатериалов/удуОбозначенияМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуОбозначенияМетодическихМатериалов</name>
  <enumValues>
    <name>Видеозапись</name>
  </enumValues>
  <enumValues>
    <name>Звукозапись</name>
  </enumValues>
  <enumValues>
    <name>Изоматериал</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Кинофильм</name>
  </enumValues>
  <enumValues>
    <name>Микроформа</name>
  </enumValues>
  <enumValues>
    <name>Мультимедиа</name>
  </enumValues>
  <enumValues>
    <name>Ноты</name>
  </enumValues>
  <enumValues>
    <name>Предмет</name>
  </enumValues>
  <enumValues>
    <name>Рукопись</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>ШрифтБрайля</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйРесурс</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуВидыМетодическихМатериалов/удуВидыМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуВидыМетодическихМатериалов</name>
  <predefined>
    <items>
      <name>Книга</name>
      <description>Книги</description>
    </items>
    <items>
      <name>ПериодическоеИздание</name>
      <description>Серии (периодические издания)</description>
    </items>
  </predefined>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуСтатьи/удуСтатьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСтатьи</name>
  <comment>Статьи журналов или отдельные произведения в сборниках</comment>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Страницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуУчетныеЕдиницы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Перем ПредставлениеОбновить;
&НаКлиенте
Перем БиблиографическоеПредставление;
&НаКлиенте
Перем БиблиографическоеПредставлениеНовое;


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 

&НаСервере
Процедура УстановитьДоступностьРеквизитов()
	Если РольДоступна("удуРаботаСЭлектроннойБиблиотекой")
		ИЛИ РольДоступна("удуВедениеУчетаМетодическихМатериалов") 
		ИЛИ РольДоступна("ПолныеПрава")  Тогда
		
		Элементы.ОбразыОбраз.КнопкаВыбора =Истина;
	Иначе
		Элементы.Авторы.ТолькоПросмотр = Истина;
		Элементы.ВидИНаправление.ТолькоПросмотр = Истина;
		Элементы.АвторыКниги.ТолькоПросмотр = Истина;
		Элементы.Книга.ТолькоПросмотр = Истина;
		Элементы.ПериодическиеИздания.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ОбразыКоманднаяПанель.Доступность = Ложь;
		Элементы.ОбразыОбраз.КнопкаВыбора = Ложь;
		Элементы.ДобавитьАвтора.Видимость = Ложь;
		Элементы.ОчиститьАвтора.Видимость = Ложь;
		Элементы.НедоступенКВыдаче.ТолькоПросмотр = Истина;
	КонецЕсли;
		
	Элементы.НомерТома.Доступность = ЗначениеЗаполнено(Объект.Многотомник);
	Если Объект.ВидМатериала = Справочники.удуВидыМетодическихМатериалов.Книга Тогда
		Элементы.Книга.Видимость = Истина;
		Элементы.АвторыКниги.Видимость = Истина;
		Элементы.Статьи.Видимость = Истина;
		Элементы.ПериодическиеИздания.Видимость = Ложь;
	ИначеЕсли Объект.ВидМатериала = Справочники.удуВидыМетодическихМатериалов.ПериодическоеИздание Тогда
		Элементы.Книга.Видимость = Ложь;
		Элементы.АвторыКниги.Видимость = Ложь;
		Элементы.ПериодическиеИздания.Видимость = Истина;
		Элементы.Статьи.Видимость = Истина;
	Иначе
		Элементы.Книга.Видимость = Истина;
		Элементы.АвторыКниги.Видимость = Ложь;
		Элементы.ПериодическиеИздания.Видимость = Ложь;
		Элементы.Статьи.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Серия) Тогда 
		Элементы.Учредитель.ТолькоПросмотр = Истина;
	Иначе 
		Элементы.Учредитель.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Элементы.АвторыКниги.Видимость = Ложь;		
КонецПроцедуры // УстановитьДоступностьРеквизитов()

// Авторы
&НаКлиенте
Процедура ДобавитьАвтора(Команда)
	
	Результат = ОткрытьФормуМодально("Справочник.удуАвторы.Форма.ВыборАвтораИРолиАвтора");
	Если ЗначениеЗаполнено(Результат) Тогда
		МассивСтрок = Объект.Авторы.НайтиСтроки(Новый Структура("Автор",Результат.Автор));
		Если МассивСтрок.Количество() = 0 Тогда
			НовыйАвтор = Объект.Авторы.Добавить();	
			НовыйАвтор.Автор = Результат.Автор;
			НовыйАвтор.Роль = Результат.Роль;
			Если ЗначениеЗаполнено(Авторы) Тогда
				Авторы = Авторы + ", ";
			КонецЕсли;
			Авторы = Авторы	+ Результат.Автор;
			Объект.АвторПредставление = Авторы;
			ОбновитьБиблиографическоеПредставление();
		Иначе
			Вопрос("Выбранный автор уже добавлен",РежимДиалогаВопрос.ОК);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьАвтора(Команда)
	Авторы = "";
	Объект.АвторПредставление = "";
	Объект.Авторы.Очистить();
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеАвтора()
	
	Авторы = "";
	Для Каждого Автор Из Объект.Авторы Цикл 
		Если Авторы <> "" Тогда 
			Авторы = Авторы + ", ";
		КонецЕсли;
		Авторы = Авторы + Автор.Автор;
	КонецЦикла;
	
КонецПроцедуры // СформироватьПредставлениеАвтора()

&НаСервере
Процедура ЗаполнитьАвторыИзАвторовМноготомника()
	Для Каждого Автор Из Объект.Многотомник.Авторы Цикл
		УжеДобавлен = Ложь;
		Для Каждого ДобавлАвтора Из Объект.Авторы Цикл
			Если Автор.Автор = ДобавлАвтора.Автор Тогда
				УжеДобавлен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не УжеДобавлен Тогда
			НовыйАвтор = Объект.Авторы.Добавить();	
			НовыйАвтор.Автор = Автор.Автор;
			НовыйАвтор.Роль = Автор.Роль;
		КонецЕсли;
	КонецЦикла;
	СформироватьПредставлениеАвтора();	
КонецПроцедуры //ЗаполнитьАвторыИзАвторовМноготомника()

// Образы
&НаСервере
Функция ОбразПриИзмененииНаСервере(Знач ОбразСсылка)
	ОбразОбъект = ОбразСсылка.ПолучитьОбъект();
	Результат = Новый Структура("Расширение",ОбразОбъект.ТекущаяВерсия.Расширение);
	Результат.Вставить("индексКартинки",ОбразОбъект.ИндексКартинки);
	Возврат Результат;
	
КонецФункции // ОбразПриИзмененииНаСервере()

&НаСервере
&НаСервере
Процедура ЗаполнитьКоличествоЭкземпляров()
	ЭкземпляровВсего = 0;
	ЭкземпляровНаПолке = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	удуУчетныеЕдиницы.Ссылка КАК УчетныеЕдиницыСсылка,
	                      |	удуУчетныеЕдиницы.Наименование,
	                      |	удуУчетныеЕдиницы.НедоступенКВыдаче,
	                      |	удуУчетныеЕдиницы.НаправлениеДеятельностиДОУ,
	                      |	удуУчетныеЕдиницы.ВидМатериала,
	                      |	ЕСТЬNULL(МатериалыНаСкладах.КоличествоОстаток, 0) КАК КоличествоОстаток,
	                      |	ЕСТЬNULL(МатериалыНаРуках.КоличествоОстаток, 0) КАК КоличествоНаРуках
	                      |ИЗ
	                      |	Справочник.удуУчетныеЕдиницы КАК удуУчетныеЕдиницы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |			удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница КАК УчетнаяЕдиница,
	                      |			СУММА(удуМетодическиеМатериалыНаРукахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |		ИЗ
	                      |			РегистрНакопления.удуМетодическиеМатериалыНаРуках.Остатки КАК удуМетодическиеМатериалыНаРукахОстатки
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница) КАК МатериалыНаРуках
	                      |		ПО удуУчетныеЕдиницы.Ссылка = МатериалыНаРуках.УчетнаяЕдиница
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			удуТМЦ_НаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |			СУММА(удуТМЦ_НаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |		ИЗ
	                      |			РегистрНакопления.удуТМЦ_НаСкладах.Остатки КАК удуТМЦ_НаСкладахОстатки
	                      |		ГДЕ
	                      |			ТИПЗНАЧЕНИЯ(удуТМЦ_НаСкладахОстатки.Номенклатура) = ТИП(Справочник.удуУчетныеЕдиницы)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			удуТМЦ_НаСкладахОстатки.Номенклатура) КАК МатериалыНаСкладах
	                      |		ПО удуУчетныеЕдиницы.Ссылка = МатериалыНаСкладах.Номенклатура
	                      |ГДЕ
	                      |	(НЕ удуУчетныеЕдиницы.ЭтоГруппа)
	                      |	И удуУчетныеЕдиницы.Ссылка = &УчетнаяЕдиница");
	Запрос.УстановитьПараметр("УчетнаяЕдиница",Объект.Ссылка);
	
	ВыборкаКолНаПолке = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаКолНаПолке.Следующий() Тогда 
		ЭкземпляровВсего = ВыборкаКолНаПолке.КоличествоОстаток;
		ЭкземпляровНаПолке = ЭкземпляровВсего - ВыборкаКолНаПолке.КоличествоНаРуках;
	КонецЕсли;
		
КонецПроцедуры // ЗаполнитьКоличествоЭкземпляров()

&НаСервере
Процедура ОбновитьБиблиографическоеПредставление()
	Если Объект.ВидМатериала = Справочники.удуВидыМетодическихМатериалов.Книга Тогда
		Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеКнига(Этаформа);
	ИначеЕсли Объект.ВидМатериала = Справочники.удуВидыМетодическихМатериалов.ПериодическоеИздание Тогда
		Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеПериодика(Этаформа);
	Иначе
		Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеКнига(Этаформа);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОСерии()
	ОбъектСерия = Объект.Серия.ПолучитьОбъект();
	Объект.Учредитель = ОбъектСерия.Учредитель;
	Объект.КоличествоСтраниц = ОбъектСерия.КоличествоСтраниц;
	Объект.Иллюстрации = ОбъектСерия.Иллюстрации;
КонецПроцедуры // ЗаполнитьИнформациюОСерии()
	
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьКоличествоЭкземпляров();
	Статьи.Параметры.УстановитьЗначениеПараметра("УчетнаяЕдиница",Объект.Ссылка);
	
	СформироватьПредставлениеАвтора();
	
	НедоступенКВыдаче = Объект.НедоступенКВыдаче;
	Если Объект.РедактироватьПредставление Тогда
		ПредставлениеОбновить = Ложь;
	Иначе
		ПредставлениеОбновить = Истина;
	КонецЕсли;
    УстановитьДоступностьРеквизитов();
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Образ Из Объект.Образы Цикл
		Если НЕ ЗначениеЗаполнено(Образ.Образ) Тогда
			Объект.Образы.Удалить(Образ);
		КонецЕсли;
	КонецЦикла;
	
	Объект.АвторПредставление = Авторы;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КоличествоЭкземпляровИзменено" Тогда
		ЗаполнитьКоличествоЭкземпляров();
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбразыОбразПриИзменении(Элемент)
	Строка = Элементы.Образы.ТекущиеДанные;
	
	Результат = ОбразПриИзмененииНаСервере(Строка.Образ);
	Строка.Тип = Результат.Расширение;
	Строка.ИндексКартинки = Результат.ИндексКартинки;
КонецПроцедуры

&НаКлиенте
Процедура ВидМатериалаПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура МноготомникПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Многотомник) Тогда
		ЗаполнитьАвторыИзАвторовМноготомника();
		Элементы.НомерТома.Доступность = Истина;
	КонецЕсли;
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатью(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Пар = Новый Структура("Владелец",Объект.Ссылка);
		ОткрытьФормуМодально("Справочник.удуСтатьи.ФормаОбъекта",Пар);
		
	Иначе
		РезультатВопроса = Вопрос("Для добавления статьи необходимо записать учетную карточку. Записать сейчас?",РежимДиалогаВопрос.ДаНет);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Записать();
			Пар = Новый Структура("Владелец",Объект.Ссылка);
			ОткрытьФормуМодально("Справочник.удуСтатьи.ФормаОбъекта",Пар);

		КонецЕсли;
	КонецЕсли;
	Статьи.Параметры.УстановитьЗначениеПараметра("УчетнаяЕдиница",Объект.Ссылка);
	Элементы.Статьи.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура НедоступенКВыдачеПриИзменении(Элемент)
	
	// Обновить список уже недоступных экземпляров данной учетной записи
	
	Если ПризнакДоступностиИзменен() Тогда
		НеобходимоИзменитьСведенияОНедоступности = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПризнакДоступностиИзменен()
	
	Возврат (НедоступенКВыдаче 
		И (Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Ссылка.НедоступенКВыдаче))
		ИЛИ (Не Объект.Ссылка.Пустая() И Объект.НедоступенКВыдаче <> Объект.Ссылка.НедоступенКВыдаче);
		
КонецФункции

// Изменение представления учетной единицы
&НаКлиенте
Процедура РедактироватьПредставление(Команда)
	БиблиографическоеПредставление = Объект.Представление;
	Если Элементы.Книга.Видимость Тогда
		Элементы.Представление.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Представление.Доступность = Истина;
		Элементы.Представление.ТолькоПросмотр = Ложь;
	ИначеЕсли Элементы.ПериодическиеИздания.Видимость Тогда
		Элементы.Представление1.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Представление1.Доступность = Истина;
		Элементы.Представление1.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПредставления(Команда)
	
	Результат = Вопрос("Сохранить изменения библиографического представления?",РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да И БиблиографическоеПредставлениеНовое <> Неопределено Тогда
		Объект.РедактироватьПредставление = Истина; // представление сформировано вручную
		Объект.Представление = БиблиографическоеПредставлениеНовое;
	Иначе
		Объект.Представление = БиблиографическоеПредставление;
	КонецЕсли;

	Если Элементы.Книга.Видимость Тогда
		Элементы.Представление.Вид = ВидПоляФормы.ПолеНадписи;
	ИначеЕсли Элементы.ПериодическиеИздания.Видимость Тогда
		Элементы.Представление1.Вид = ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
			
КонецПроцедуры

// Автоматически обновлять представление при изменении основных 
// реквизитов учетной карточки
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура СведенияОтносящиесяКЗаглавиюПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НомерТомаПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КнигаИздательствоПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КнигаМестоИзданияПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КнигаИзданиеПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура Год1ПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();

КонецПроцедуры

&НаКлиенте
Процедура КнигаКоличествоСтраницПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КнигаИллюстрацииПриИзменении(Элемент)
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПриИзменении(Элемент)
	БиблиографическоеПредставлениеНовое = Объект.Представление;
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура Представление1ПриИзменении(Элемент)
	БиблиографическоеПредставлениеНовое = Объект.Представление;
	ОбновитьБиблиографическоеПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставление(Команда)
	Если Объект.РедактироватьПредставление Тогда
		Рез = Вопрос("Представление было отредактировано. Продолжить?",РежимДиалогаВопрос.ДаНет);
		Если Рез = КодВозвратаДиалога.Да Тогда 
			ОбновитьБиблиографическоеПредставление();
			Объект.РедактироватьПредставление = Ложь;
		КонецЕсли;
	Иначе
		ОбновитьБиблиографическоеПредставление();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодическоеИздание1ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Серия) Тогда
		ЗаполнитьИнформациюОСерии();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если НеобходимоИзменитьСведенияОНедоступности = Истина Тогда
				
		Если ТекущийОбъект.НедоступенКВыдаче = Истина Тогда
			
			МЗ = РегистрыСведений.удуНедоступныеМетодическиеМатериалы.СоздатьМенеджерЗаписи();
			МЗ.УчетнаяЕдиница = ТекущийОбъект.Ссылка;
			МЗ.Записать(Ложь);
			
		Иначе
			
			Отбор =  Новый Структура("УчетнаяЕдиница", ТекущийОбъект.Ссылка);
			Выборка = РегистрыСведений.удуНедоступныеМетодическиеМатериалы.Выбрать(Отбор);
			
			Пока Выборка.Следующий() Цикл
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
			КонецЦикла;
			
		КонецЕсли;
		
		НеобходимоИзменитьСведенияОНедоступности = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
